Raw-wrk-files/run-1/query/rails-stripped-jruby/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Wed Oct 16 03:20:56 PDT 2013

  System load:  0.04               Processes:           118
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 0%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

52 packages can be updated.
19 updates are security updates.


---------------------------------------------------------
 Running Primer rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/rails/hello_world/db?queries=2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.69ms    1.51ms  18.94ms   93.98%
    Req/Sec   295.93     66.51   454.00     60.07%
  11068 requests in 5.00s, 4.23MB read
Requests/sec:   2212.62
Transfer/sec:    865.53KB

---------------------------------------------------------
 Running Warmup rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   136.77ms   53.19ms 310.65ms   65.34%
    Req/Sec   233.50     11.10   270.00     66.54%
  27972 requests in 15.01s, 10.69MB read
Requests/sec:   1863.93
Transfer/sec:    729.13KB

---------------------------------------------------------
 Queries: 1 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   108.35ms   44.07ms 243.48ms   66.79%
    Req/Sec   294.23     19.40   339.00     76.44%
  35225 requests in 15.01s, 12.39MB read
Requests/sec:   2346.83
Transfer/sec:    845.19KB

---------------------------------------------------------
 Queries: 5 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   207.22ms   68.66ms 443.60ms   67.23%
    Req/Sec   151.01     14.98   242.00     91.09%
  18127 requests in 15.03s, 8.59MB read
Requests/sec:   1206.05
Transfer/sec:    585.22KB

---------------------------------------------------------
 Queries: 10 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   331.31ms   79.58ms 618.50ms   66.75%
    Req/Sec    96.14      6.30   108.00     82.49%
  11504 requests in 15.04s, 7.19MB read
Requests/sec:    764.67
Transfer/sec:    489.71KB

---------------------------------------------------------
 Queries: 15 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   453.00ms   98.43ms 766.38ms   68.12%
    Req/Sec    70.23      3.87    81.00     73.88%
  8390 requests in 15.04s, 6.52MB read
Requests/sec:    557.86
Transfer/sec:    443.84KB

---------------------------------------------------------
 Queries: 20 for rails-stripped-jruby
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/rails/hello_world/db?queries=20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/rails/hello_world/db?queries=20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   569.41ms  109.65ms   1.05s    67.10%
    Req/Sec    54.98      5.16    65.00     90.16%
  6596 requests in 15.06s, 6.12MB read
Requests/sec:    438.00
Transfer/sec:    416.46KB